   
  ! Подпрограмма расчета внутренних данных размеров элеменотв цилиндра
  ! knal=1 (один объект)
  !nal=3 (три элемента гладкой поверхности)
  !nallm(1)=3  (три элемента гладкой поверхности в первом объекте)
  ! ee=0 (матрица поворотов объекта)
  ! ff=0 - матрица смещения объекта
  !AA - матрица полуосей аппроксимируэщих эллипсоидов
  !TF - матрица поворотов аппроксимирующих эллипсоидов (единичная)
  !DD - матрица смещений аппроксимирующих эллипсоидов
  !ceps1, ceps2 - действительная и мнимая части относительной диэлектрической проницаемости материала аппроксимирующих эллипсоидов
  !cmi1, cmi2 - действительная и мнимая части относительной магнитной проницаемости материала аппроксимирующих эллипсоидов
  !ctol - признак материала аппроксимирующих эллипсоидов
  !npp - количество плоскостей отсечения аппроксимирующих эллипсоидов
  !pp - координаты вектора отсекающей плоскости
  !zpp - признак отсекающей плоскости (1 или -1)
  !kon1 - длина волны
  !acr - радиус цилиндра 
  !dleen - длина цилиндра

      subroutine fileindat (knal,nal,nallm,ee,ff,AA,TF,DD,ceps1,ceps2,
     +cmi1,cmi2,ctol,npp,pp,zpp,kon1,acr,dleen)
      integer n,k,nal,knal
      REAL AA    (3,nal), PP   (10,nal,3)
      REAL TF    (3,nal),   DD  (3,nal)
      real ee (3, knal), ff (3,knal)
      INTEGER  NPP   (nal), ZPP   (10,nal), nallm(knal)
      real ceps1 (nal), cmi1 (nal)
      real ceps2 (nal), cmi2 (nal)     
      real ctol  (nal)
      real kon1,acr,dleen


      ee(1,  1)=   0.000000
      ee(2,  1)=   0.000000
      ee(3,  1)=   0.000000
      ff(1,  1)=   0.000000
      ff(2,  1)=   0.000000
      ff(3,  1)=   0.000000
      nallm(1)=  3
      AA(1,  1)=   acr
      AA(2,  1)=   acr
      AA(3,  1)=  dleen*10.000000
      TF(1,  1)=   0.000000
      TF(2,  1)=   0.000000
      TF(3,  1)=   0.000000
      DD(1,  1)=   0.000000
      DD(2,  1)=   0.000000
      DD(3,  1)=   0.000000
      ceps1(  1)=   1.000000
      ceps2(  1)=   0.000000
      cmi1(  1)=   1.000000
      cmi2(  1)=   0.000000
      ctol(  1)=   0.000000
      NPP( 1)= 2
      PP( 1,  1,1)=   0.000000
      PP( 1,  1,2)=   0.000000
      PP( 1,  1,3)=  -dleen/2+kon1*0.5
	if(PP( 1,  1,3)>=0.0) PP( 1,  1,3)=-0.001
      zPP( 1, 1)= 1
      PP( 2,  1,1)=   0.000000
      PP( 2,  1,2)=   0.000000
      PP( 2,  1,3)=   dleen/2-kon1*0.5
	if(PP( 2,  1,3)<=0.0) PP( 1,  1,3)=0.001
      zPP( 2, 1)= 1
      AA(1,  2)=   acr-kon1*0.5
      AA(2,  2)=   acr-kon1*0.5
	if (AA(1,  2)<=0.0) then
      AA(1,  2)=   0.001
      AA(2,  2)=   0.001
      end if
      AA(3,  2)=   0.000500
      TF(1,  2)=   0.000000
      TF(2,  2)=   0.000000
      TF(3,  2)=   0.000000
      DD(1,  2)=   0.000000
      DD(2,  2)=   0.000000
      DD(3,  2)=  -dleen/2
      ceps1(  2)=   1.000000
      ceps2(  2)=   0.000000
      cmi1(  2)=   1.000000
      cmi2(  2)=   0.000000
      ctol(  2)=   0.000000
      NPP( 2)= 1
      PP( 1,  2,1)=   0.000000
      PP( 1,  2,2)=   0.000000
      PP( 1,  2,3)=  -dleen/2
      zPP( 1, 2)=-1
      AA(1,  3)=   acr-kon1*0.5
      AA(2,  3)=   acr-kon1*0.5
	if (AA(1,  3)<=0.0) then
      AA(1,  3)=   0.001
      AA(2,  3)=   0.001
      end if
      AA(3,  3)=   0.0005000
      TF(1,  3)=   0.000000
      TF(2,  3)=   0.000000
      TF(3,  3)=   0.000000
      DD(1,  3)=   0.000000
      DD(2,  3)=   0.000000
      DD(3,  3)=   dleen/2
      ceps1(  3)=   1.000000
      ceps2(  3)=   0.000000
      cmi1(  3)=   1.000000
      cmi2(  3)=   0.000000
      ctol(  3)=   0.000000
      NPP( 3)= 1
      PP( 1,  3,1)=   0.000000
      PP( 1,  3,2)=   0.000000
      PP( 1,  3,3)=   dleen/2
      zPP( 1, 3)=-1



  
      return
      end